# Задача №22
# Даны два неупорядоченных набора целых чисел (может быть, с
# повторениями). Выдать без повторений в порядке возрастания все те числа, которые
# встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
# элементов второго множества. Затем пользователь вводит сами элементы множеств.
# Пример:
# 11 6
# 2 4 6 8 10 12 10 8 6 4 2
# 3 6 9 12 15 18
# 6 12

from random import randint as rd

n = int(input('Введите кол-во элементов первого множества: '))
n_set = set(rd(1, 20) for i in range(n))
print(*n_set)

m = int(input('Введите кол-во элементов второго множества: '))
m_set = set(rd(1, 20) for i in range(m))
print(*m_set)

s_set = sorted(n_set.intersection(m_set))
print(*s_set)
